package com.aj.frame.ydjwpt;

import com.aj.frame.api.F;
import com.aj.frame.idstring.FormatedIdString;
import com.aj.frame.idstring.IdString;

/**
 * 
 * @ClassName: IdStringToken 
 * @Description: <b>移动警务平台的服务端字符串ID定义接口</b>
 * @author liuling 
 * @date 2016-8-30 下午07:41:14 
 *
 */
public interface IdStringToken extends com.aj.frame.api.Ids {
	
	/**
	 * <b>移动警务平台相关的ID字符串定义</b>
	 *
	 */
	interface Ydjwpt {
		/**
		 * 缺省的用户模型处理器ID
		 */
		enum DefaultProcessorIds {
			获取同步数据,
			// APP处理器ID
			查询评价记录,
			获取我的收藏,
			消息列表,
			状态反馈,
			添加共享设备用户,
			删除共享设备用户,
			获取设备共享的用户列表,
			获取版本的图片描述,
			获取应用,
			评价,
			获取应用评价,
			下载反馈,
			添加收藏,
			取消收藏,
			获取应用下载地址,
			意见反馈,
			GPS定位采集,
			删除系统消息,
			同步用户数据,
			导入三卡信息,
			APP对象计数器统计,
			获取分类标签信息,
			信息统计计数器事件队列处理器,
			删除三卡冗余数据,
			删除用户三卡数据,
			删除终端设备授权_无记录,
			删除加密卡,
			删除手机卡,
			删除移动终端设备,
			获取APP访问榜列表,
			获取APP下载榜列表,
			获取APP下载飙升榜列表,
			获取APP热搜榜列表,
			用户操作行为分析, 
			获取APP好评榜列表,
			获取用户手机号码,
			株洲获取登录信息,
			株洲获取第三方应用信息,

			// WEB处理器ID
			注册APP开发帐号,
			申请成为开发者账号,
			新增开发者账号申请流程单据,
			获取开发者账号申请流程单据,
			获取开发账号审核集合,
			获取开发账号查询集合,
			获取平台用户信息,
			获取终端用户信息,
			获取终端角色用户信息,
			获取当前登录用户信息,
			获取用户信息,
			修改用户信息,
			获取待授权批次信息,
			新增手机卡,
			新增批次设备发机,
			授权批次信息,
			通过角色获取功能对象集合,
			获取地区信息,获取部门信息,新增快捷功能,获取快捷功能,删除快捷功能,修改快捷功能,修改手机卡,
			禁用或恢复某个基础服务,
			删除平台通知,
			获取终端设备授权,获取更换终端组件待授权集合,删除终端设备授权,获取APP对象中最新APP版本,获取APP对象中发布版本,
			新增APP版本,申请手机新增,申请手机修改,申请手机查询,
			取消设备挂失,
			获取我的平台通知,
			获取我的APP最新版本集合,
			获取APP的基础服务统计对象,
			获取APP的基础服务,
			获取基础服务的APP对象,
			获取通知消息,
			删除通知消息,
			获取新发APP版本,
			获取更新APP版本,
			获取公司,
			发送消息,
			获取有未匹配记录的批次信息,
			新增APP评测,
			发机批次统计,
			获取有未匹配记录的批次信息统计,
			文件上传,
			获取授权设备分配共享用户关系,
			根据用户获取更换终端组件记录,
			修改终端设备授权,
			获取APP对象,获取APP版本,
			修改部门信息,
			删除部门信息,
			获取APP申请流程单据,
			新增部门信息,
			获取警种,
			获取应用最新的版本列表, 
			获取基础服务, 
			获取机型,
			新增机型, 
			获取通知消息未接收人集合, 
			新增数据字典, 
			获取数据字典, 
			获取APP评论,
			删除授权设备分配共享用户关系,
			修改机型,
			删除机型, 
			获取更新APP待评测集合,
			新增APP申请流程单据, 
			修改App对象,
			获取职级,
			获取角色,
			修改数据字典,
			删除数据字典,
			删除批次设备发机,
			获取新发APP待评测集合,
			获取批次已匹配终端设备授权,
			新增通知消息记录,
			修改批次设备发机, 
			获取通知消息未查看人集合,
			获取批次未匹配终端设备授权, 
			获取通知消息记录,
			禁用或恢复某个APP的某个基础服务,
			禁用或恢复某个APP的所有基础服务,
			审核APP开发者账号,
			获取开发者帐号,
			授权终端设备,
			禁用终端设备,
			取消禁用终端设备,
			修改终端设备授权状态变更记录,
			挂失终端设备,
			注销终端责任人,
			取消注销终端责任人,
			解释网页图片,
			获取应用类型分类信息,
			获取用户类别信息,
			获取分类标签目录信息,
			获取视图用户信息,
			获取用户会话详情信息列表,
			获取未登录警员信息列表,
			获取文件实体列表,
			获取终端首页配置信息,
			新增终端首页配置信息,
			记录第三方操作日志,
			获取第三方操作日志列表,
			获取功能对象列表,
			// WEB_启动页管理接口
			新增启动页信息,
			获取启动页列表,
			获取启动页详情,
			修改启动页信息,
			删除启动页信息,
			获取登录启动页信息,
			获取已登录警员信息列表,
			修改终端首页配置信息,
			记录操作日志,
			获取用户操作日志列表,
			
			// 智能搜索处理器ID
			智能搜索,
			查询人员详情,
			查询车辆详情,
			查询案件详情,
			查询驾驶人详情,
			查询违法犯罪人员详情,
			查询在逃人员详情,
			查询盗抢车辆详情,
			查询涉案人员详情,
			获取照片,
			获取缩略图,
			
			// 通用
			获取客户端配置对象,
			新增警种,
			新增职级,
			保存文件实体,
			//权限管理范围控制别名处理器
			APP审核权限_获取新发APP版本,
			APP审核权限_获取更新APP版本,
			APP管理权限_获取APP对象中最新APP版本,
			APP管理权限_获取APP对象中发布版本,
			用户设备授权权限_获取待授权批次信息,
			用户设备授权权限_获取更换终端组件待授权集合,
			用户设备授权权限_获取终端设备授权,
			用户设备授权权限_获取待授权批次信息统计,
			开发账号审核权限_获取开发账号审核集合,
			用户管理权限_获取用户信息,
			基础服务管理权限_获取基础服务,
			发机信息维护权限_获取有未匹配记录的批次信息,
			发机信息维护权限_获取有未匹配记录的批次信息统计,
			APP评测权限_获取新发APP评测,
			APP评测权限_获取更新APP评测,
			基础服务管理权限_获取APP对象,
			基础服务管理权限_获取基础服务的APP对象,
			查看通告权限_获取通知消息,
			部门信息维护权限_获取部门信息,

			//获取文件实体列表别名
			大数据对象_获取文件实体列表,

			批量增加部门,
			根据GID获取用户信息,
			
			//数据上报数据抽取接口
			应用市场服务端注册信息查询,
			应用市场服务端注册信息更新,
			获取APP应用基础信息,
			文件数据查询,
			同步应用标签目录,
			同步应用分类标签,
			APP对象计数器统计查询,
			应用日活情况查询,
			查询最大更新时间,
			应用评分信息数据查询,
			应用评论数据查询,
			测试,

			// 工具
			运行删除三卡数据,

			统计计数器初始化数据,
			用户错误信息更新,
			
			查询发机授权列表,
			查询发机授权详情,
			发机授权,
		}
		/**
		 * 字符串常量定义
		 */
		enum Strings implements IdString {
			// 人关联查询
			查询名下车辆信息		    (50000),
			查询驾驶人信息				(50001),
			比对在逃人员信息 			(50002),
			比对违法犯罪人员信息			(50003),
			// 车关联查询
			查询车主信息				(50004),
			比对盗抢车辆信息			(50005),
			// 案关联查询
			查询涉案人员信息			(50006),
			查询涉案车辆信息			(50007),
			// 在逃人员、违法犯罪人员、盗抢车辆关联查询
			查询涉案信息				(50008),
			;

			/**
			 * id值
			 */
			private int id;
			Strings(int id) {
				this.id = id;
			}
			@Override
			public int getId() {
				return this.id;
			}
			@Override
			public String getString() {
				return F.getIdStrings().getString(this);
			}
			@Override
			public String getName() {
				return this.name();
			}
			@Override
			public IdString format(Object... args) {
				return new FormatedIdString(this.getId(), this.getName(), args);
			}
			@Override
			public Object[] getFormatArgs() {
				return null;
			}
		}
		/**
		 * 移动警务平台智能搜索的错误ID定义
		 */
		enum SearchErrors implements IdString {
			用户未登陆      (-40001),
			没有开启网络 (-40002),
			传入参数错误 (-40003),
			接口服务故障 (-40004),
			系统错误 (-40005)
			;

			/**
			 * id值
			 */
			private int id;
			SearchErrors(int id) {
				this.id = id;
			}
			@Override
			public int getId() {
				return this.id;
			}
			@Override
			public String getString() {
				return F.getIdStrings().getString(this);
			}
			@Override
			public String getName() {
				return this.name();
			}
			@Override
			public IdString format(Object... args) {
				return new FormatedIdString(this.getId(), this.getName(), args);
			}
			@Override
			public Object[] getFormatArgs() {
				return null;
			}
		}
		/**
		 * 移动警务平台的错误ID定义
		 */
		enum Errors implements IdString {
			用户已被禁止登入系统		    (-21011),
			错误的用户信息或登入密码		    (-21010),
			未指定有效的用户帐号		    (-21007),
			密码错误次数过多		        (-28001),
			设备初始化未授权		        (-31001),
			设备信息不匹配		            (-31002),
			用户未授权		            (-31003),
			用户设备已挂失		            (-31004),
			无权限进行该操作		        (-31010),
			_s参数为空		            (-31011),
			_s超过了_d的最大长度		    (-31012),
			当前用户objId不存在		    (-31013),
			数据库没有查询出结果            (-31018),
			app对象主键不存在				(-31014),
			app对象评论不存在				(-31015),
			目录不存在                    (-31016),
			该版本号已存在                 (-31017),
			该数据已经存在                 (-31097),
			该部门存在下级部门不可删除       (-31098),
			部门代码不能为空				 (-31018),
			重复的部门代码					(-31019),
			部门名称不能为空					(-31020),
			上级部门不能为空					(-31021),
			所属地区不能为空					(-31022),
			该数据已存在						(-31023),
			未填写品牌						(-31024),
			未填写手机型号编码						(-31025),
			未填写手机型号						(-31026),
			未选择系统版本						(-31027), 			
			必须上传5张应用市场图片           (-31028),
			请选择警种                        (-31029), 
			请选择地区                        (-31030),  
			请输入安全通信端口号                (-31031),  
			最多输入30字               (-31032),  
			请输入软件名称                (-31033), 
			请输入软件描述                (-31034), 
			请上传ICON图片                (-31035), 
			请上传应用市场图片                (-31036),
			请选择是否必装               (-31037),
			未填写字典编码				(-31038),
			未填写字典名称						(-31039),
			未填写类型名称						(-31040),
			未填写类别代码						(-31041),
			未选择有效的模块						(-31042),
			功能模块不存在						(-31043),
			功能模块序号不能为空						(-31044),
			用户ID不能为空                 (-31045),
			上级部门不存在					(-31046),
			地区不存在						(-31047),
			记录不存在						(-31048),
			评测人不能为空						(-31049),
			评测报告不能为空					(-31050),
			App版本ID不能为空					(-31051),
			是否通过不能为空					(-31051),
			保存失败						(-31053),
			必填字段为空                      (-31059),
			App版本状态不是待审核				(-31052),
			App版本状态不是待评测              (-50010),
			终端设备授权主键为空              (-31060),
			没有与部门代码匹配的地区			(31061),
			部门代码长度错误				(31062),
			部门代码中包含非数字字符			(31063),
			部门代码格式错误				(31064),
			部门代码重复					(31065),
			app版本代码输入错误				(31066),
			用户未授权查看新发APP待评测集合      (31076),
			警号不能重复 			(31077),
			该警种不存在 			(31078),
			该职级不存在 					(31079),
			该部门不存在 			(31080),
			没有创建该地区用户的权限 			(31081),
			没有为用户分配_s角色的权限 		(-31082),
			该app版本状态与要修改的状态一致       (-31088),
			手机品牌不能为空  (-31089),
			手机型号编号不能为空 (-31090),
			手机型号不能为空 (-31091),
			系统版本不能为空 (-31092),
			警号不能为为空_0 (-31093),
			姓名不能为空_1		(-31094),
			身份证不能为空_2 (-31095),
			警种不能为空_3 	(-31096),
			职级不能为空_4	(-31097),
			所属部门不能为空_5 (-31098),
			手机号码不能为空_6	(-31099),
			所属地区不能为空_7	(-31100),
			部门代码不能为空_8 (-31101),
			部门名称不能为空_9 (-31102),
			上级部门代码不能为空_10 (-31103),
			负责人警号不能为空_11 (-31104),
			联系人电话不能为空_12 (-31105),
			所属地区不能为空_13		(-31106),
			详细地址不能为空_14		(-31107),
			手机品牌不能为空_15 (-31108),
			手机型号编号不能为空_16 (-31109),
			手机型号不能为空_17	(-31110),
			系统版本不能为空_18 (-31111),
			未填写类型名称_19 (-31112),
			未填写字典名称_20 (-31113),
			未填写字典编码_21 (-31114),
			负责人警号不存在 (-31115),
			取消发布状态不可以评测(-31116),
			身份证号码格式不符_22(-31117),
			用户类别不能为空(-311187),
			该批次无对应sim卡信息  (-31157),
			没有获得使用该基础服务接口的授权 (-31158),
			该批次已生效不可删除(-31159),
			该sim卡无对应授权信息(-31160),
			该app版本不存在  (-31161),
			该app版本存在调用成功  (-39998),
			通知消息接收着用户为空  (-39999),
			此用户为当前用户_无权操作       (-40000),
			用户已存在        (-40001),
			用户未授权查看更新APP待评测集合      (-40002),
			该手机型号对应的系统版本已存在      (-40003),   
			审核失败			(-40005),
			不存在的基础服务      (-40004),
			主管单位ID不能为空   (-40006),
			该记录不是待审核状态   (-40007),
			是否适配格式不正确 (-40050),
			是否适配不能为空 (-40051),
			手机名称不能为空(-40008),
			操作系统不能为空(-40009),
			备注不能为空(-40010),
			操作状态不为上下级关系 (-40011),
			取消发布状态不可以审核 (-40012),
			警号不能大于10位_12 (-40013),
			未填写审核意见 (-40014),
			评测未通过不能取消发布 (-40015),
			试点未通过不能取消发布 (-40016),
			审核未通过不能取消发布 (-40017),
			身份证号已提交申请如需重复申请请联系管理员(-40018),
			手机申请主键ID不能为空 (-40019),
			手机申请主键ID不存在 (-40020),
			手机申请查询登录警号不能为空 (-40021),
			手机申请查询结果为空 (-40022),
			基础服务主键ID不能为空(-40023),
			基础服务未启动(-40025),
			未找到当前用户授权设备信息(-40026),
			地区主键不能为空(-40027),
			名称不能为空(-40028),
			链接不能为空(-40029),
			停留时间不能为空(-40030),
			显示顺序不能为空(-40031),
			关联业务类型不能为空(-40032),
			附件名称不能为空(-40033),
			附件类型不能为空(-40034),
			附件内容不能为空(-40035),
			附件后缀不能为空(-40036),
			该地区已经存在启动页信息不能重复新增(-40037),
			该地区已经存在启动页信息不能重复修改(-40038),
			主键不能为空(-40039),
			系统未配置全省地区代码(-40040),
			已存在的职级名		(-40041),
			排序冲突			(-40042),
			已存在的警种			(-40043),
			警种不能为空			(-40044),
			排序不能为空			(-40045),
			用户所属分类不存在			(-40046),
			

			警号格式必须为纯数字或字母加数字 (-40047),
			计数器信息未初始化 (-40048),
			App应用无法确认唯一性 (-40049),
			APP应用不存在 (-40070),
			包名不能为空 (-40071),
			用户信息不存在 (-40072),
			用户名不能为空 (-40073),
			身份证号码与用户名全为空(-40074),

			//web端将IdStringWeb移除后，服务端仍然引用的错误定义新增
			无法识别的终端设备 (-40100),
			证书卡错误 (-40101),
			无法识别的手机卡 (-40102),
			没有使用这台终端设备的权限 (-40103),
			手机卡与用户不匹配 (-40104),
			无法识别的证书卡 (-40105),
			证书卡与用户不匹配 (-40106),
			证书卡已被禁止使用 (-40107),
			证书卡已经与手机卡_s绑定 (-40108),
			终端机型未适配 (-40109),
			终端设备已被禁止使用 (-40110),
			终端设备已经与手机卡_s绑定 (-40111),
			终端设备尚未获得授权 (-40112),
			终端设备和手机卡不匹配 (-40113),
			证书卡和手机卡不匹配 (-40114),
			手机卡已被禁止使用 (-40115),
			该部门代码已经存在 (-40116),
			实际发机数量超出计划发机数量 (-40117),
			手机卡串号错误 (-40118),
			手机号码不能为空 (-40119),
			身份证号码不能为空 (-40120),
			找不到身份证号码对应的用户 (-40121),
			数据重复 (-40122),
			手机卡导入错误 (-40123),
			部门下面没有人员			(-40124),
			当前时间范围没有人登录			(-40125),
			找不到与警号对应的用户 (-40126),
			找到与警号对应的多个用户 (-40127),

			终端设备授权不存在(40128),
			加密卡不存在(-40129),
			手机卡不存在(-40130),
			移动终端设备不存在(-40131),
			删除失败_s(-40132),

			创建失败(-40133),
			已废弃(-40134),
			地区已经存在相关配置(-40135),
			当前用户存在多个授权信息(-40136),
			
			该岗位信息不存在(-50000),
			;
			
			/**
			 * id值
			 */
			private int id;
			Errors(int id) {
				this.id = id;
			}
			@Override
			public int getId() {
				return this.id;
			}
			@Override
			public String getString() {
				return F.getIdStrings().getString(this);
			}
			@Override
			public String getName() {
				return this.name();
			}
			@Override
			public IdString format(Object... args) {
				return new FormatedIdString(this.getId(), this.getName(), args);
			}
			@Override
			public Object[] getFormatArgs() {
				return null;
			}
		}
	}
}
